app/controllers/categories_controller.rb

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Cuota Casa2"], ["updated_at", "2019-08-03 21:08:46.447653"], ["id", 1]]
---
  def update

      if @category.update(category_params)