app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses"
SELECT "categories".* FROM "categories"
---
  def index
    @tab = :expenses
    @expenses = Expense.all
    @categories = Category.all

INSERT INTO "expenses" ("date", "amount", "concept", "type_id", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @expense = Expense.new(params_expenses)
    if @expense.save

UPDATE "expenses" SET "amount" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["amount", 30000.0], ["updated_at", "2019-08-24 18:28:24.340776"], ["id", 1]]
---
  def update
    if @expense.update(params_expenses)

DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 1]]
---
  def destroy
    @expense.destroy

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_expense
    @expense = Expense.find(params[:id])