app/views/expenses/_form.html.erb

SELECT "types".* FROM "types" ORDER BY "types"."name" ASC
---
                <%= f.label :Type %>
                <%= f.collection_select(:type_id, Type.order(:name), :id, :name, {prompt: 'Select expense type'}, {class: "form-control"}) %>

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
                <%= f.label :Category %>
                <%= f.collection_select(:category_id, Category.order(:name), :id, :name, {prompt: 'Select a Category'}, {class: "form-control"}) %>